tap "homebrew/bundle"
tap "homebrew/services"

brew "bat"
brew "colordiff"
brew "coreutils"
brew "fd"
brew "feh"
brew "fzf"
brew "git"
brew "git-crypt"
brew "gnutls"
brew "htop"
brew "jq"
brew "make"
brew "nmap"
brew "pango"
brew "pgcli"
brew "pinentry-mac"
brew "pipx"
brew "ripgrep"
brew "terraform"
brew "terraformer"
brew "tesseract"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "charles"
cask "dash"
cask "docker"
cask "firefox@developer-edition"
cask "gimp"
cask "iterm2"
cask "nextcloud"
cask "nextcloud"
cask "postgres-unofficial"
cask "protonmail-bridge"
cask "protonmail-bridge"
cask "raycast"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tailscale"
cask "todoist"
cask "whatsapp"
cask "zoom"
mas "Fantastical", id: 975_937_182


#emacs
tap "d12frosted/emacs-plus"
## Build requirements for emacs30. Explicitly stating to prevent dependency warn.
brew "autoconf"
brew "awk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "imagemagick"
brew "isl"
brew "jansson"
brew "jansson"
brew "jpeg"
brew "libgccjit"
brew "libmpc"
brew "libxml2"
brew "mas"
brew "mpfr"
brew "pkg-config"
brew "texinfo"
brew "tree-sitter"
brew "zlib"
# Emacs!
brew "emacs-plus@30", args: ["with-ctags", "with-xwidgets", "with-imagemagick", "with-native-comp", "with-modern-doom3-icon"]
# Configuration Dependencies
brew "aspell"
brew "bash-language-server"
brew "cmake"
brew "editorconfig"
brew "graphviz"
brew "harfbuzz"
brew "isync"
brew "languagetool", restart_service: true
brew "marked"
brew "mu"
brew "node"
brew "pgformatter"
brew "pngpaste"
brew "prettier"
brew "pyright"
brew "shellcheck"
brew "shfmt"
brew "stylelint"
cask "font-alegreya"
cask "font-hasklig"
cask "font-hasklug-nerd-font"
tap "hashicorp/tap" ; brew "hashicorp/tap/terraform-ls"


# Work
brew "ant"
brew "openjdk@17"
brew "rbenv"
brew "ruby-build"
cask "postgres-unofficial"
## Ops
brew "ansible"
brew "ansible-language-server"
brew "ansible-lint"
brew "awscli"
